nxp-appcodehub/dm-lpc5536-evse-sigbrd/drivers/fsl_spi_dma.c
    /* Set SPI state to idle */
    handle->state = (uint8_t)kSPI_Idle;

    /* Set handle to global state */
    s_dmaPrivateHandle[instance].base   = base;
    s_dmaPrivateHandle[instance].handle = handle;

    /* Install callback for Tx dma channel */
    DMA_SetCallback(handle->txHandle, SPI_TxDMACallback, &s_dmaPrivateHandle[instance]);
    DMA_SetCallback(handle->rxHandle, SPI_RxDMACallback, &s_dmaPrivateHandle[instance]);

    return kStatus_Success;
}

/*!
 * brief Perform a non-blocking SPI transfer using DMA.
 *
 * note This interface returned immediately after transfer initiates, users should call
 * SPI_GetTransferStatus to poll the transfer status to check whether SPI transfer finished.
 *
 * param base SPI peripheral base address.
 * param handle SPI DMA handle pointer.
 * param xfer Pointer to dma transfer structure.
 * retval kStatus_Success Successfully start a transfer.
 * retval kStatus_InvalidArgument Input argument is invalid.
 * retval kStatus_SPI_Busy SPI is not idle, is running another transfer.
 */
status_t SPI_MasterTransferDMA(SPI_Type *base, spi_dma_handle_t *handle, spi_transfer_t *xfer)
{
    assert(!((NULL == handle) || (NULL == xfer)));

    uint32_t instance;
    status_t result = kStatus_Success;
    spi_config_t *spi_config_p;
    uint32_t address;
    void *nextDesc                   = NULL;
    uint32_t firstTimeSize           = 0;
    dma_transfer_config_t xferConfig = {0};
    spi_config_p                     = (spi_config_t *)SPI_GetConfig(base);
    bool firstTimeIntFlag            = false;
    bool lastTimeIntFlag             = false;
    uint8_t bytesPerFrame =
        (uint8_t)((spi_config_p->dataWidth > kSPI_Data8Bits) ? (sizeof(uint16_t)) : (sizeof(uint8_t)));
    handle->bytesPerFrame = bytesPerFrame;
    uint8_t lastwordBytes = 0U;

    if ((xfer->configFlags & (uint32_t)kSPI_FrameAssert) != 0U)
    {
        handle->lastwordBytes = bytesPerFrame;
        lastwordBytes         = bytesPerFrame;
    }
    else
    {
        handle->lastwordBytes = 0U;
        lastwordBytes         = 0U;
    }

    if ((NULL == handle) || (NULL == xfer))
    {
        return kStatus_InvalidArgument;
    }

    /* Byte size is zero. */
    if (xfer->dataSize == 0U)
    {
        return kStatus_InvalidArgument;
    }
    /* cannot get instance from base address */
    instance = SPI_GetInstance(base);

    /* Check if the device is busy */
    if (handle->state == (uint8_t)kSPI_Busy)
    {
        return kStatus_SPI_Busy;
    }
    else
    {
        /* Set the dma unit by dataSize */
        if (xfer->dataSize <= bytesPerFrame)
        {
            nextDesc         = NULL;
            firstTimeSize    = xfer->dataSize;
            firstTimeIntFlag = false;
            lastTimeIntFlag  = true;
        }
        else if (xfer->dataSize - lastwordBytes <= handle->dataBytesEveryTime)
        {
            firstTimeSize = xfer->dataSize - lastwordBytes;
            if (lastwordBytes != 0U)
            {
                firstTimeIntFlag = false;
                lastTimeIntFlag  = false;
                nextDesc         = &s_spi_descriptor_table[instance];
            }
            else
            {
                nextDesc         = NULL;
                firstTimeIntFlag = true;
            }
        }
        else
        {
            firstTimeSize    = handle->dataBytesEveryTime;
            nextDesc         = NULL;
            firstTimeIntFlag = true;
            lastTimeIntFlag  = false;
        }

        /* Clear FIFOs before transfer. */
        base->FIFOCFG |= SPI_FIFOCFG_EMPTYTX_MASK | SPI_FIFOCFG_EMPTYRX_MASK;
        base->FIFOSTAT |= SPI_FIFOSTAT_TXERR_MASK | SPI_FIFOSTAT_RXERR_MASK;

        handle->state        = (uint8_t)kSPI_Busy;
        handle->transferSize = xfer->dataSize;

        /* receive */
        SPI_EnableRxDMA(base, true);
        address = (uint32_t)&base->FIFORD;
        if (xfer->rxData != NULL)
        {
            handle->rxEndData = xfer->rxData + xfer->dataSize;
            DMA_PrepareTransfer(&xferConfig, (uint32_t *)address, xfer->rxData, bytesPerFrame, firstTimeSize,
                                kDMA_PeripheralToMemory, NULL);
            handle->rxNextData = xfer->rxData + firstTimeSize;
        }
        else
        {
            DMA_PrepareTransfer(&xferConfig, (uint32_t *)address, &s_rxDummy,
                                ((spi_config_p->dataWidth > kSPI_Data8Bits) ? (sizeof(uint16_t)) : (sizeof(uint8_t))),
                                xfer->dataSize, kDMA_StaticToStatic, NULL);
        }
        (void)DMA_SubmitTransfer(handle->rxHandle, &xferConfig);
        handle->rxInProgress = true;
        DMA_StartTransfer(handle->rxHandle);

        /* transmit */
        SPI_EnableTxDMA(base, true);
        address = (uint32_t)&base->FIFOWR;
        if (xfer->txData != NULL)
        {
            handle->txEndData  = xfer->txData + xfer->dataSize;
            handle->txNextData = xfer->txData + firstTimeSize;
            if ((xfer->configFlags & (uint32_t)kSPI_FrameAssert) != 0U)
            {
                PrepareTxLastWord(xfer, &s_txLastWord[instance], spi_config_p);
            }
            /* If end of tranfer function is enabled and data transfer frame is bigger then 1, use dma
             * descriptor to send the last data.
             */
            if (((xfer->configFlags & (uint32_t)kSPI_FrameAssert) != 0U) &&
                ((spi_config_p->dataWidth > kSPI_Data8Bits) ? (xfer->dataSize > 2U) : (xfer->dataSize > 1U)))
            {
                dma_xfercfg_t tmp_xfercfg;
                tmp_xfercfg.valid         = true;
                tmp_xfercfg.swtrig        = true;
                tmp_xfercfg.intA          = false;
                tmp_xfercfg.byteWidth     = 4U;
                tmp_xfercfg.srcInc        = 0;
                tmp_xfercfg.dstInc        = 0;
                tmp_xfercfg.transferCount = 1U;
                tmp_xfercfg.reload        = false;
                tmp_xfercfg.clrtrig       = false;
                tmp_xfercfg.intB          = true;
                /* Create chained descriptor to transmit last word */
                DMA_CreateDescriptor(&s_spi_descriptor_table[instance], &tmp_xfercfg, &s_txLastWord[instance],
                                     (uint32_t *)address, NULL);
            }

//            uint32_t new_tx[32] = {0} ;
//                        for( int  i = 0 ; i < 24 ; i++ )
//                        {
//                        	new_tx[i] = (   (  xfer->txData)[i]  ) | kSPI_FrameAssert |kSPI_FrameDelay | SPI_FIFOWR_LEN(15) ;
//                        }
//
//                        DMA_PrepareTransfer(&xferConfig, new_tx , (uint32_t *)address, 4U ,  4U*12,
//                                                       kDMA_MemoryToPeripheral, NULL /*nextDesc*/);

