nxp-appcodehub/dm-lpc5536-evse-sigbrd/drivers/fsl_spi_dma.c
    return status;
}

static void SPI_RxDMACallback(dma_handle_t *handle, void *userData, bool transferDone, uint32_t intmode)
{
    spi_dma_private_handle_t *privHandle = (spi_dma_private_handle_t *)userData;
    spi_dma_handle_t *spiHandle          = privHandle->handle;
    SPI_Type *base                       = privHandle->base;
    status_t result                      = kStatus_Success;
    uint8_t bytesPerFrame                = spiHandle->bytesPerFrame;
    uint32_t nextDataSize                = 0;
    uint32_t address                     = (uint32_t)&base->FIFORD;

    if (spiHandle->rxNextData >= spiHandle->rxEndData)
    {
        /* change the state */
        spiHandle->rxInProgress = false;
        /* All finished, call the callback */
        if ((spiHandle->txInProgress == false) && (spiHandle->rxInProgress == false))
        {
            spiHandle->state = (uint8_t)kSPI_Idle;
            if (spiHandle->callback != NULL)
            {
                (spiHandle->callback)(base, spiHandle, kStatus_Success, spiHandle->userData);
            }
        }
    }
    else
    {
        /* need transmit by DMA again */
        if (spiHandle->rxEndData <= (spiHandle->dataBytesEveryTime + spiHandle->rxNextData))
        {
            nextDataSize = (uint32_t)((uint32_t)spiHandle->rxEndData - (uint32_t)spiHandle->rxNextData);
        }
        else if (spiHandle->rxEndData > (spiHandle->dataBytesEveryTime + spiHandle->rxNextData))
        {
            nextDataSize = spiHandle->dataBytesEveryTime;
        }
        else
        {
            /* MISRA 15.7*/
        }
        dma_transfer_config_t xferConfig = {0};
        DMA_PrepareTransfer(&xferConfig, (uint32_t *)(address), (uint8_t *)spiHandle->rxNextData, bytesPerFrame,
                            nextDataSize, kDMA_PeripheralToMemory, NULL);
        spiHandle->rxNextData = (uint8_t *)(spiHandle->rxNextData + nextDataSize);
        result                = DMA_SubmitTransfer(spiHandle->rxHandle, &xferConfig);
        if (result != kStatus_Success)
        {
            return;
        }
        DMA_StartTransfer(spiHandle->rxHandle);
    }
}

static void SPI_TxDMACallback(dma_handle_t *handle, void *userData, bool transferDone, uint32_t intmode)
{
    spi_dma_private_handle_t *privHandle = (spi_dma_private_handle_t *)userData;
    spi_dma_handle_t *spiHandle          = privHandle->handle;
    SPI_Type *base                       = privHandle->base;
    status_t result                      = kStatus_Success;
    uint32_t instance                    = spiHandle->instance;
    bool thisTimeIntFlag                 = false;
    uint8_t bytesPerFrame                = spiHandle->bytesPerFrame;
    void *nextDesc                       = NULL;
    uint32_t nextDataSize                = 0U;
    uint8_t lastwordBytes                = spiHandle->lastwordBytes;
    uint32_t writeAddress                = (uint32_t) & (base->FIFOWR);
    if (spiHandle->txNextData + lastwordBytes >= spiHandle->txEndData)
    {
        spiHandle->txInProgress = false;
        if ((spiHandle->txInProgress == false) && (spiHandle->rxInProgress == false))
        {
            spiHandle->state = (uint8_t)kSPI_Idle;
            if (spiHandle->callback != NULL)
            {
                (spiHandle->callback)(base, spiHandle, kStatus_Success, spiHandle->userData);
            }
        }
    }
    else
    {
        if ((uint32_t)((uint32_t)(spiHandle->txEndData)) <=
            (spiHandle->dataBytesEveryTime + lastwordBytes + (uint32_t)spiHandle->txNextData))
        {
            if (lastwordBytes != 0U)
            {
                nextDesc        = &s_spi_descriptor_table[instance];
                thisTimeIntFlag = false;
            }
            else
            {
                thisTimeIntFlag = true;
            }
            nextDataSize = (uint32_t)((uint32_t)spiHandle->txEndData - (uint32_t)spiHandle->txNextData - lastwordBytes);
        }
        else if ((uint32_t)(spiHandle->txEndData) >
                 (spiHandle->dataBytesEveryTime + lastwordBytes + (uint32_t)spiHandle->txNextData))
        {
            nextDesc        = NULL;
            nextDataSize    = spiHandle->dataBytesEveryTime;
            thisTimeIntFlag = true;
        }
        else
        {
            /* MISRA 15.7*/
        }
        dma_transfer_config_t xferConfig = {0};
        DMA_PrepareTransfer(&xferConfig, (uint8_t *)spiHandle->txNextData, (uint32_t *)(writeAddress), bytesPerFrame,
                            nextDataSize, kDMA_MemoryToPeripheral, nextDesc);
        spiHandle->txNextData   = (uint8_t *)(spiHandle->txNextData + nextDataSize);
        xferConfig.xfercfg.intA = thisTimeIntFlag;
        xferConfig.xfercfg.intB = false;
        result                  = DMA_SubmitTransfer(spiHandle->txHandle, &xferConfig);
        if (result != kStatus_Success)
        {
            return;
        }
        DMA_StartTransfer(spiHandle->txHandle);
    }
}

/*!
 * brief Abort a SPI transfer using DMA.
 *
 * param base SPI peripheral base address.
 * param handle SPI DMA handle pointer.
 */
void SPI_MasterTransferAbortDMA(SPI_Type *base, spi_dma_handle_t *handle)
{
    assert(NULL != handle);

    /* Stop tx transfer first */
    DMA_AbortTransfer(handle->txHandle);
    /* Then rx transfer */
    DMA_AbortTransfer(handle->rxHandle);

    /* Set the handle state */
    handle->txInProgress = false;
    handle->rxInProgress = false;
    handle->state        = (uint8_t)kSPI_Idle;
}

/*!
 * brief Gets the master DMA transfer remaining bytes.
 *
 * This function gets the master DMA transfer remaining bytes.
 *
 * param base SPI peripheral base address.
 * param handle A pointer to the spi_dma_handle_t structure which stores the transfer state.
 * param count A number of bytes transferred by the non-blocking transaction.
 * return status of status_t.
 */
status_t SPI_MasterTransferGetCountDMA(SPI_Type *base, spi_dma_handle_t *handle, size_t *count)
{
    assert(handle != NULL);

    if (NULL == count)
    {
        return kStatus_InvalidArgument;
    }

    /* Catch when there is not an active transfer. */
    if (handle->state != (uint8_t)kSPI_Busy)
    {
        *count = 0;
        return kStatus_NoTransferInProgress;
    }

    size_t bytes;

    bytes = DMA_GetRemainingBytes(handle->rxHandle->base, handle->rxHandle->channel);

    *count = handle->transferSize - bytes;

    return kStatus_Success;
}
